cf_billing/DataProcessors/энргМаршрутыКонтроллеровМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргМаршрутыКонтроллеровМенеджер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргКлючиПомещенийМаршрутовКонтролеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКлючиПомещенийМаршрутовКонтролеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>МаршрутКонтролера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаршрутыКонтроллеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/DataProcessors/энргМаршрутыКонтроллеровМенеджер/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает данные маршрута по ключу помещения.
//
// Параметры:
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ДанныеМаршрутаПоКлючуПомещения(КлючПомещения) Экспорт  
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжМаршрутыКонтроллеровМенеджер") = Неопределено Тогда
				Возврат Обработки["слжМаршрутыКонтроллеровМенеджер"].ДанныеМаршрутаПоКлючуПомещения(КлючПомещения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= Справочники.энргМаршрутыКонтроллеров.ДанныеМаршрутаПоКлючуПомещения(КлючПомещения);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "МаршрутыКонтроллеровМенеджер.ДанныеМаршрутаПоКлючуПомещения";
		ПараметрыМетода 			= Новый Структура("КлючПомещения", КлючПомещения);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Регистрирует ключ помещения в маршруте контролера.
//
// Параметры:
//  МаршрутКонтролера	-	СправочникСсылка.энргМаршрутыКонтроллеров.
//  КлючПомещения		-	СправочникСсылка.энргКлючиПомещений.
//
Процедура ЗарегистрироватьКлючПомещенияВМаршрутеКонтролера(МаршрутКонтролера, КлючПомещения) Экспорт
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжМаршрутыКонтроллеровМенеджер") = Неопределено Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 	
		
	РегистрыСведений.энргКлючиПомещенийМаршрутовКонтролеров.ЗарегистрироватьКлючПомещенияВМаршрутеКонтролера(МаршрутКонтролера, КлючПомещения);		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
